// Масиви та об'єкти:
// - Створити масив, наповнити його 10 елементами будь-якого типу, вивести кожен елемент в консоль

let key = [100, 'Hi', true, 3.14, -15, 'By', 66, 203, 'Ok', 99];
console.log(key);

// - Створити 3 об'єкти які описують книги. Поля об'єкту : title ,pageCount, genre.

let book_1 = {
    title: 'The Witcher',
    pageCount: 321,
    genre: 'fantasy'
}

let book_2 = {
    title: 'The Lord of the Rings',
    pageCount: 543,
    genre: 'fantasy'
}

let book_3 = {
    title: 'Schindler`s Ark',
    pageCount: 400,
    genre: 'historical novel'
}

// - Створити 3 об'єкти які описують книги. Поля об'єкту : title ,pageCount, genre, authors. Поле "автори" - являється  масивом. Кожен автор має поля name та age.

let book_4 = {
    title: 'IT',
    pageCount: 296,
    genre: 'horror',
    authors: {
        name: 'Stephen King',
        age: 75
    }
}

let book_5 = {
    title: 'Harry Potter',
    pageCount: 450,
    genre: 'fantasy',
    authors: {
        name: 'Joanne Rowling',
        age: 57
    }
}

let book_6 = {
    title: 'A Song of Ice and Fire',
    pageCount: 600,
    genre: 'fantasy',
    authors: {
        name: 'George Martin',
        age: 74
    }
}

// - Створити масив з 10 об'єктами, які описують сутніть "користувач". Поля: name, username,password. Вивести в консоль пароль кожного користувача

let users = {

}

// Логічні розгалуження:
//     - Є змінна х, якій ви надаєте довільне числове значення.
//     Якщо змінна x не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3
// - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).
// - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).
// - Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день
// (можна замість плану на день, назву дня англійською).
//     - Користувач вводить або має два числа.
//         Потрібно знайти та вивести максимальне число з тих двох .
//         Також потрібно врахувати коли введені рівні числа.
//
//     - є змінна х, яка може прийняти будь-яке значення (стрінг, число, undefined, null  і тд включно). Напишіть код який,
//         за допомоги  оператора || буде присвоювати змінній х значення "default"  якщо значення змінної х являється falsy (хибноподібні, тобто приводиться до false)
//
//
//     - з файлу arrays.js (лежить в папці 2023 plan ) взяти масив coursesAndDurationArray. За допомоги іф перевірити кожен його елемент на тривалість навчання.
//     У випадку якщо тривалість довша за 5 місяців вивести в консоль "Супер".



